Revit 2024 API
ControlledApplication.Cities Property
Returns a set of all the known city locations within Revit.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public CitySet Cities { get; }
Visual Basic
Public ReadOnly Property Cities As CitySet
	Get
Visual C++
public:
property CitySet^ Cities {
	CitySet^ get ();
}
Remarks
Each city has information about longitude, latitude etc.
See Also
ControlledApplication Class
Autodesk.Revit.ApplicationServices Namespace